src/DataProcessors/КассовыйСервер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>КассовыйСервер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ОчередьКассовогоСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьКассовогоСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПробития</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФискальногоЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаПробитияЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеансаИБ</Name>
					<Comment>Номер сеанса ИБ, в которой пробивался чек </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПробитияЧекаКассовымСервером</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПречековыйПринтер</Name>
					<Comment>BeforeCheckPrinters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
					<Comment>API</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/КассовыйСервер/Forms/ФормаИнтерфейсаКассовогоСервера/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметыКассовогоСервера = ПодключаемоеОборудованиеКассовыйСервер.ПараметрыКассовогоСервера();
	Если ПараметыКассовогоСервера = Неопределено
		ИЛИ НЕ ПараметыКассовогоСервера.Свойство("КассаОплаты")
		ИЛИ НЕ ЗначениеЗаполнено(ПараметыКассовогоСервера.КассаОплаты) Тогда
		
		ЭтотОбъект.РаботаРазрешена = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаЗапрещена;
		Элементы.ДекорацияСообщение.Заголовок   = НСтр("ru = 'Кассовый сервер не настроен!'; en = 'The cash server is not configured!'");
		ЭтотОбъект.СписокОплаты.Параметры.УстановитьЗначениеПараметра("ОрганизацияОтбор", Неопределено);		
		Возврат;		
	КонецЕсли;
		       
	Если ПроверитьСсылкаБитая(ПараметыКассовогоСервера.КассаОплаты) = Истина Тогда
		ЭтотОбъект.РаботаРазрешена = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаЗапрещена;
		Элементы.ДекорацияСообщение.Заголовок   = НСтр("ru = 'Касса кассового сервера не добавлена в доступные кассы сотрудника!';
													   |en = 'The cash register of the cash server is not added to the available cash registers of the employee!'");
		ЭтотОбъект.СписокОплаты.Параметры.УстановитьЗначениеПараметра("ОрганизацияОтбор", Неопределено);		
		Возврат;
	КонецЕсли;
			
	ЭтотОбъект.КассаФискализации                   = ПараметыКассовогоСервера.КассаОплаты;
	// Доработка Юля
	ЭтотОбъект.ОрганизацияПоКассе                  = ЭтотОбъект.КассаФискализации.СтруктурнаяЕдиница.Организация;
	// Конец
	ЭтотОбъект.ИнтервалыОпросаОчереди              = ПараметыКассовогоСервера.ИнтервалВремениПроверкиОчереди;
	ЭтотОбъект.ИнтервалПробитияЧеков               = ПараметыКассовогоСервера.ИнтервалПробитияЧеков;
	ЭтотОбъект.ПередаватьСмсКлиента                = ПараметыКассовогоСервера.ОтправлятьЧекПоСмс;
    ЭтотОбъект.ПередаватьПочтуКлиента              = ПараметыКассовогоСервера.ОтправлятьЧекПоЭлектроннойПочте;
	ЭтотОбъект.ПечатьНаБумаге 					   = ?(ПараметыКассовогоСервера.Свойство("ПечатьНаБумаге"), ПараметыКассовогоСервера.ПечатьНаБумаге, Ложь);

	ЭтотОбъект.КассаИспользуетсяККТ                = КассаИспользуетсяККТ(ЭтотОбъект.КассаФискализации);
	ЭтотОбъект.ИспользоватьСтарыйРежимФискализации = ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(ЭтотОбъект.КассаФискализации); 
	
	ЭтотОбъект.РежимРаботыВОтдельномСеансе         = ПараметыКассовогоСервера.РежимРаботыСеанса = 1;
	
	СостояниеКассовойСмены      = ПолучитьСостояниеКассовойСмены(ЭтотОбъект.КассаФискализации);	
	// Доработка Юля
	// Если нет ни одной кассовой смены.
	ОписаниеЗапрета = "";
	Если СостояниеКассовойСмены = Неопределено Тогда
		ОписаниеЗапрета = СтрШаблон(НСтр("ru = 'По кассе ""%1"", кассовая смена не открыта.'; en = 'At the cash register ""%1"", cash register shift is not open.'"), ЭтотОбъект.КассаФискализации);
	ИначеЕсли НЕ ЭтотОбъект.ПередаватьПочтуКлиента И НЕ ЭтотОбъект.ПередаватьСмсКлиента Тогда
		ОписаниеЗапрета = НСтр("ru = 'Не заданы параметры отправки чека по СМС или Email в настройках кассового сервера'; en = 'No settings for sending a check by SMS or Email in the settings of the cash server'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеЗапрета) Тогда
		ЭтотОбъект.РаботаРазрешена = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаЗапрещена;
		Элементы.ДекорацияСообщение.Заголовок   = ОписаниеЗапрета;
		ЭтотОбъект.СписокОплаты.Параметры.УстановитьЗначениеПараметра("ОрганизацияОтбор", ?(ЗначениеЗаполнено(ЭтотОбъект.ОрганизацияПоКассе), ЭтотОбъект.ОрганизацияПоКассе, Неопределено));
		Возврат;  		
	КонецЕсли;  	
		
	ЭтотОбъект.ДатаНачалаОтбора = СостояниеКассовойСмены.НачалоКассовойСмены;		
	ЭтотОбъект.КассоваяСмена    = СостояниеКассовойСмены.КассоваяСмена;
	ОтобразитьСостояниеКассовойСменыСервер(СостояниеКассовойСмены);  	
	Элементы.ОткрытьКассовуюСмену.Заголовок = Строка(ЭтотОбъект.КассаФискализации);	
	
	// Доработка Юля
	ЭтотОбъект.СписокОплаты.Параметры.УстановитьЗначениеПараметра("ОрганизацияОтбор", ?(ЗначениеЗаполнено(ЭтотОбъект.ОрганизацияПоКассе), ЭтотОбъект.ОрганизацияПоКассе, Неопределено)); 	
	УстановитьРазрешениеРаботы();
	
КонецПроцедуры

// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтотОбъект.РаботаРазрешена = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	СтартФискализациии(Неопределено);
	
КонецПроцедуры

// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Если ЭтотОбъект.РежимРаботыВОтдельномСеансе = Истина Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	Если ЭтотОбъект.КассовыйСерверЗапущен = Истина Тогда
		
		ЭтотОбъект.КассовыйСерверЗапущен = Ложь;
		ЭтотОбъект.ИдетПечатьЧека        = Ложь;
		
		ОтключитьОбработчикОжидания("ОбработчикТаймераПоступленияДокументовНаФискализацию");
		ОтключитьОбработчикОжидания("ПробитьЧекОбработчикТаймера");
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Установить разрешение работы
//
&НаСервере
Процедура УстановитьРазрешениеРаботы()
	
	ЭтотОбъект.РаботаРазрешена = Истина;
    Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаРазрешена;

	УстановитьПривилегированныйРежим(Истина);
	
	Если КассовыйСервер.ВТекущемСеансеРазрешенЗапускКассовогоСервера() = Ложь Тогда
		
		ЭтотОбъект.РаботаРазрешена = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаЗапрещена;
		Элементы.ДекорацияСообщение.Заголовок   = НСтр("ru = 'На текущем рабочем месте запрещен запуск кассового сервера!'; en = 'Starting the cash server is prohibited at the current workplace!'");
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
		
	КонецЕсли;
	
	Если ЭтотОбъект.РежимРаботыВОтдельномСеансе = Истина Тогда
		
		ПараметыКассовогоСервера = ПодключаемоеОборудованиеКассовыйСервер.ПараметрыКассовогоСервера();
	
		Если ПараметыКассовогоСервера.Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
			
			ЭтотОбъект.РаботаРазрешена = Истина;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаРазрешена;
			
		Иначе
			
			ЭтотОбъект.РаботаРазрешена = Ложь;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРаботаЗапрещена;
			Элементы.ДекорацияСообщение.Заголовок   = НСтр("ru = 'Пользователь текущего сеанса не явялется пользователем кассового сервера!'; en = 'The user of the current session is not a cash server user!'");
			
			УстановитьПривилегированныйРежим(Ложь);

			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
			
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Процедура - Проверить кассовую смену
//
&НаКлиенте
Процедура ПроверитьКассовуюСмену()
	
	УстановитьКартинкуСтатуса(3, Истина);
	РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, ЭтотОбъект.КассаФискализации, Неопределено, Неопределено, Ложь);
		
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены
//
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт 
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		
		Элементы.СтартФискализациии.Доступность = Истина;
		Элементы.СтопФискализации.Доступность   = Ложь;
		Элементы.ОткрытьКассовуюСмену.Доступность = Истина;
		
		ЭтотОбъект.КассовыйСерверЗапущен = Ложь;
		
		УстановитьКартинкуСтатуса(4, Истина);

		СостояниеКассовойСмены      = ПолучитьСостояниеКассовойСмены(ЭтотОбъект.КассаФискализации);		
	    ЭтотОбъект.КассоваяСмена    = СостояниеКассовойСмены.КассоваяСмена;

	    ОтобразитьСостояниеКассовойСмены(СостояниеКассовойСмены);
		
		ПоказатьПредупреждение(, ОписаниеОшибки);
		Возврат;
		
	Иначе 
		
		Если ЭтотОбъект.КассовыйСерверЗапущен = Истина Тогда
			СтартФискализациииЗавершение();
		КонецЕсли;
		
	КонецЕсли;
	  
	СостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(ЭтотОбъект.КассаФискализации);	
	Если СостояниеКассовойСмены = Неопределено Тогда
		ОписаниеЗапрета = СтрШаблон(НСтр("ru = 'По кассе ""%1"", кассовая смена не открыта.'; en = 'At the cash register ""%1"", cash register shift is not open.'"),
							ЭтотОбъект.КассаФискализации);
		
		Элементы.СтартФискализациии.Доступность		= Истина;
		Элементы.СтопФискализации.Доступность		= Ложь;
		Элементы.ОткрытьКассовуюСмену.Доступность	= Истина;
		
		ЭтотОбъект.КассовыйСерверЗапущен			= Ложь;
		
		УстановитьКартинкуСтатуса(4, Истина);

	    ОтобразитьСостояниеКассовойСмены(Неопределено);
		
		ПоказатьПредупреждение(, ОписаниеОшибки);
		Возврат;
	КонецЕсли;	
	
	ЭтотОбъект.ДатаНачалаОтбора = СостояниеКассовойСмены.НачалоКассовойСмены;
	ЭтотОбъект.ДатаКассовйСмены = СостояниеКассовойСмены.НачалоКассовойСмены;
	ЭтотОбъект.КассоваяСмена    = СостояниеКассовойСмены.КассоваяСмена;
	
	// Доработка Юля
	ЭтотОбъект.СписокОплаты.Параметры.УстановитьЗначениеПараметра("ОрганизацияОтбор", ?(ЗначениеЗаполнено(ЭтотОбъект.ОрганизацияПоКассе), ЭтотОбъект.ОрганизацияПоКассе, Неопределено)); 

КонецПроцедуры

#КонецОбласти

#Область УправлениеКассовымСервером

// Процедура - Открыть кассовую смену
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ОткрытьКассовуюСмену(Команда)
	
	ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаУправленияКассовойСменой");	
	
КонецПроцедуры

// Процедура - Старт фискализациии
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура СтартФискализациии(Команда)
	
	ЗаписатьВЖурналРегистрацииСообщение(НСтр("ru = 'Запускается.'; en = 'Starting.'"));
	
	ЭтаФорма.Заголовок = НСтр("ru = 'Кассовый сервер - запускается'; en = 'Cash server - starting'");
	
	ЭтотОбъект.КассовыйСерверЗапущен = Истина;
	ПодключитьОбработчикОжидания("ПроверитьКассовуюСмену", 1, Истина);
	
	Элементы.СтартФискализациии.Доступность   = Ложь;
	Элементы.СтопФискализации.Доступность     = Истина;
	Элементы.КассаФискализации.Доступность    = Ложь;
	Элементы.ОткрытьКассовуюСмену.Доступность = Ложь;

КонецПроцедуры

// Процедура - Старт фискализациии завершение
//
&НаКлиенте
Процедура СтартФискализациииЗавершение()
	
	ЭтотОбъект.КассовыйСерверЗапущен = Истина;
	ПодключитьОбработчикОжидания("ОбработчикТаймераПоступленияДокументовНаФискализацию", 1, Истина);

	ЗаписатьВЖурналРегистрацииСообщение(НСтр("ru = 'Запущен.'; en = 'Running.'"));
    ЭтаФорма.Заголовок = НСтр("ru = 'Кассовый сервер - запущен'; en = 'Cash server - running'");
	
	УстановитьКартинкуСтатуса(0, Истина);

	Элементы.СтартФискализациии.Доступность  = Ложь;
	Элементы.СтопФискализации.Доступность    = Истина;
	Элементы.КассаФискализации.Доступность   = Ложь;
    Элементы.ОткрытьКассовуюСмену.Доступность = Ложь;

КонецПроцедуры

// Процедура - Стоп фискализации
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура СтопФискализации(Команда)
	
	ЭтотОбъект.КассовыйСерверЗапущен = Ложь;
	ЭтотОбъект.ИдетПечатьЧека        = Ложь;
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераПоступленияДокументовНаФискализацию");
	ОтключитьОбработчикОжидания("ПробитьЧекОбработчикТаймера");

	ЭтаФорма.Заголовок = НСтр("ru = 'Кассовый сервер - остановлен'; en = 'Cash server - stopped'");
	ЗаписатьВЖурналРегистрацииСообщение(НСтр("ru = 'Остановлен.'; en = 'Stopped.'"));
	
	УстановитьКартинкуСтатуса(0, Ложь);

	Элементы.СтартФискализациии.Доступность   = Истина;
	Элементы.СтопФискализации.Доступность     = Ложь;
	Элементы.КассаФискализации.Доступность    = Истина;
    Элементы.ОткрытьКассовуюСмену.Доступность = Истина;

КонецПроцедуры

#Область ОчередьДокументов

// Процедура - Обработчик таймера поступления документов на фискализацию
//
&НаКлиенте
Процедура ОбработчикТаймераПоступленияДокументовНаФискализацию()
	
	Если ЭтотОбъект.КассовыйСерверЗапущен = Ложь Тогда
		Возврат
	КонецЕсли;
	
	ЭтотОбъект.ВремяНачалаОбработкиОчереди = ТекущаяДата();
	
	// Доработка Юля (параметр Организация)
	ДокументыНафискализацию = КассовыйСервер.ПолучитьВсеНеОплаченныеДокументИзОчередиДляТекущегоСеанса(, ОрганизацияПоКассе, КассаФискализации);
	// Конец
	ЭтотОбъект.ОчередьФискализации.ЗагрузитьЗначения(ДокументыНафискализацию);
			
	Если ЭтотОбъект.ОчередьФискализации.Количество() > 0 Тогда		
		
		КассовыйСервер.ЗаписатьПризнакНачалаПробитияЧекаДляМассиваДокументов(ДокументыНафискализацию);
		
		ЗаписатьВЖурналРегистрацииСообщение(НСтр("ru = 'Поступило на фискализацию: '; en = 'Received by fiscalization: '") + ЭтотОбъект.ОчередьФискализации.Количество());
		
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("{End}"); 
		
		ПодключитьОбработчикОжидания("ПробитьЧекОбработчикТаймера", 0.3, Истина);
		
	Иначе
		
		ПодключитьОбработчикОжидания("ОбработчикТаймераПоступленияДокументовНаФискализацию", ЭтотОбъект.ИнтервалыОпросаОчереди, Истина);
		
	КонецЕсли;
	
	Элементы.СписокОплаты.Обновить();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура СписокОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокОплаты.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДокументОплаты) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура; 
		ПараметрыОткрытия.Вставить("Документ", ТекущиеДанные.ДокументОплаты);		
		ПараметрыОткрытия.Вставить("Статус"  , ТекущиеДанные.Статус);
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокОплатыВыборЗавершение", ЭтотОбъект);
		ОткрытьФорму("Обработка.КассовыйСервер.Форма.ФормаДиалога", ПараметрыОткрытия,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик завершения выбора.
//
Процедура СписокОплатыВыборЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.ОбновитьСписок Тогда
		
		Элементы.СписокОплаты.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеФискализации

// Процедура - Пробить чек обработчик таймера
//
&НаКлиенте
Процедура ПробитьЧекОбработчикТаймера()
	
	Если ЭтотОбъект.ОчередьФискализации.Количество() = 0 
		ИЛИ ЭтотОбъект.ИдетПечатьЧека = Истина
		ИЛИ ЭтотОбъект.КассовыйСерверЗапущен = Ложь Тогда
		
		Возврат;
	КонецЕсли;
	
	//Если форма не в фокусе ввода, то ожидаем возврат на форму 
	//Если ЭтотОбъект.РежимРаботыВОтдельномСеансе = Ложь
	//	И ВводДоступен() = Ложь  Тогда
	//	
	//	ПодключитьОбработчикОжидания("ПробитьЧекОбработчикТаймера", 3, Истина);
	//	Возврат;
	//	
	//КонецЕсли;
	
	//Проверять статус кассовой смены каждые 180 сек
	//если смена закрыта, то ожидать открытия нвоой смены 
	Если (ТекущаяДата() - ЭтотОбъект.ПоследняяДатаУспешнойПроверкиКассовойСмены) >= 180 Тогда
		
		СостояниеКассовойСмены   = ПолучитьСостояниеКассовойСмены(ЭтотОбъект.КассаФискализации);	
		ЭтотОбъект.КассоваяСмена = СостояниеКассовойСмены.КассоваяСмена;

		ОтобразитьСостояниеКассовойСмены(СостояниеКассовойСмены);
		
		Если НЕ СостояниеКассовойСмены.СтатусыКассовойСмены = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта") Тогда
			
			ПодключитьОбработчикОжидания("ПробитьЧекОбработчикТаймера", 60, Истина);
			Возврат;
			
		КонецЕсли;	
					
		ЭтотОбъект.ПоследняяДатаУспешнойПроверкиКассовойСмены = ТекущаяДата();
	КонецЕсли;
	
	ЭтотОбъект.ИдетПечатьЧека = Истина;
	
    УстановитьКартинкуСтатуса(1, Истина);
	
	ДокументОплаты = ЭтотОбъект.ОчередьФискализации[0].Значение;
		
	ОписаниеЗапрета = Неопределено;
	
	Если ФискализацияДокументаРазрешена(ДокументОплаты, ОписаниеЗапрета) = Ложь Тогда		
		ЗавершитьПробитиеЧека(ДокументОплаты, ОписаниеЗапрета);		
		Возврат;
	КонецЕсли;
	
	// Доработка Юля
	// Бесплатную реалзиацию пробивать не нужно по ФР
	Если ДокументРеализацияБесплатно(ДокументОплаты) = Истина Тогда
		ЗаписатьПризнакПробитияЧекаРеализацияБесплатно(ДокументОплаты);
		// Удалим из очереди бесплатный документ
		ЗавершитьПробитиеЧека(ДокументОплаты, ОписаниеЗапрета);
		Возврат;
	КонецЕсли;          	
	
	Если ЭтотОбъект.ИспользоватьСтарыйРежимФискализации = Ложь Тогда
		ФормированиеЧека = ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляККТ(ДокументОплаты);
	Иначе
		ФормированиеЧека = ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляФР(ДокументОплаты);
	КонецЕсли;
		
	Если ФормированиеЧека.Результат Тогда
		
		ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ЭтотОбъект.КассаФискализации);
		
		Если ФормированиеЧека.Свойство("ФискальныйЧек") Тогда
			
			ПробитиеРазрешено = Ложь;			
			
			Если ЭтотОбъект.ПередаватьСмсКлиента И ЗначениеЗаполнено(ФормированиеЧека.ФискальныйЧек.ПокупательНомер) Тогда
				ПробитиеРазрешено = Истина;
			ИначеЕсли  ЭтотОбъект.ПередаватьПочтуКлиента И ЗначениеЗаполнено(ФормированиеЧека.ФискальныйЧек.ПокупательEmail) Тогда
				ПробитиеРазрешено = Истина;
			КонецЕсли;
			
			Если Не ПробитиеРазрешено Тогда
				ОписаниеЗапрета = "У клиента не заполнена контактная информация";
				ЗавершитьПробитиеЧека(ДокументОплаты, ОписаниеЗапрета);
				Элементы.СписокОплаты.Обновить();
				Возврат;				
			КонецЕсли; 			
			
			Контекст = Новый Структура();
			Контекст.Вставить("ТипЧека"       , Истина);
			Контекст.Вставить("ДокументОплаты", ДокументОплаты);

			Оповещение            = Новый ОписаниеОповещения("ПробитьЧекЗавершение"            , ЭтотОбъект, Контекст);
			ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека"    , ЭтотОбъект, Контекст);
			ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
			
			ОбщиеПараметры = ФормированиеЧека.ФискальныйЧек;
			МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройстваФР, , ПослеОткрытияЧека, ПослеОшибкиПечатиЧека);		
			
		КонецЕсли;			
		
		Если ФормированиеЧека.Свойство("НефискальныйЧек") Тогда
			
			ТекстЧека  = ФормированиеЧека.НефискальныйЧек;
			Контекст   = Новый Структура();
			Контекст.Вставить("ТипЧека"       , Ложь);
			Контекст.Вставить("ДокументОплаты", ДокументОплаты);
			
			Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
			МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);
			
		КонецЕсли;		
		
	Иначе
		
		ОписаниеОшибки = ФормированиеЧека.ОписаниеОшибки;
		ТекстСообщения = НСтр("ru='При проведение оплаты произошла ошибка.										"
"Дополнительное описание: %ДополнительноеОписание%';en='With holding payment happened mistake. Additional description: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);					
		
		ЗавершитьПробитиеЧека(ДокументОплаты, ТекстСообщения);

	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийФискальника

&НаКлиенте
// Процедура, обработчик описания оповещения.
//
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	
	Если ПараметрыВыполнения.НомерСмены <> 0 Тогда
		ШапкаЧека.НомерСмены = ПараметрыВыполнения.НомерСмены;
	КонецЕсли;
	
	Если ПараметрыВыполнения.НомерЧека <> 0 Тогда
		ШапкаЧека.НомерЧека = ПараметрыВыполнения.НомерЧека;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
		
КонецПроцедуры

&НаКлиенте
// Процедура, завершение пробития чека на ФР.
//
Процедура ПробитьЧекЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ОписаниеОшибки = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда		
	
		Если РезультатВыполнения.ВыходныеПараметры <> Неопределено Тогда
			
			НомерЧекаККМ = 0;
			Если ДополнительныеПараметры.ТипЧека Тогда
				НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
			Иначе
				НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
			КонецЕсли;	
			
			Попытка 
				ИдентификаторФискальнойЗаписи = "";
				Если РезультатВыполнения.ВыходныеПараметры.Количество() > 8 Тогда
					ПараметрыФискализации = РезультатВыполнения.ВыходныеПараметры[8];
					ИдентификаторФискальнойЗаписи = ПараметрыФискализации.ИдентификаторФискальнойЗаписи;
				КонецЕсли;
				ЗаписатьРезультатПробитияЧека(ДополнительныеПараметры.ДокументОплаты, НомерЧекаККМ, ЭтотОбъект.КассоваяСмена, ИдентификаторФискальнойЗаписи);
				
			Исключение
				
				СтопФискализации(Неопределено);
				ПоказатьПредупреждение(,НСтр("ru='Кассовый сервер остановлен по причине невозможности записать результат пробития чека. Описание: ';en='Cash server stopped due to impossibility writedown result penetration check. Description:'") + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе 		
		
		ТекстСообщения = НСтр("ru='При печати чека произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';en='With print check happened mistake."
"Check not printedby on fiscal registrar."
"Additional description:"
"AdditionalDescription'");
		ОписаниеОшибки = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		                         				
	КонецЕсли;
	
	ЗавершитьПробитиеЧека(ДополнительныеПараметры.ДокументОплаты, ОписаниеОшибки);

	Элементы.СписокОплаты.Обновить();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт

	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	ШапкаЧека.НомерЧека = ШапкаЧека.НомерЧека + 1000000;

КонецПроцедуры

#КонецОбласти

// Процедура - Завершить пробитие чека
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
//
&НаКлиенте
Процедура ЗавершитьПробитиеЧека(ДокументОплаты, ОписаниеОшибки)
	
	ЗавершенСОшибкой = ЗначениеЗаполнено(ОписаниеОшибки); 
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ЗаписатьОшибкуПечатиЧека(ДокументОплаты, ОписаниеОшибки);			
		ЗаписатьВЖурналРегистрацииОшибку(ОписаниеОшибки);	
		
		УстановитьКартинкуСтатуса(2, Истина);

	КонецЕсли;
	
	УдалитьДокументИзОчередиПечати(ДокументОплаты);
	
	ИдетПечатьЧека = Ложь;
		
	Если ЭтотОбъект.КассовыйСерверЗапущен = Истина Тогда
		
		Если ЭтотОбъект.ОчередьФискализации.Количество() > 0 Тогда
			
			Тайминг = ?(ЭтотОбъект.РежимРаботыВОтдельномСеансе, ЭтотОбъект.ИнтервалПробитияЧеков, 0.3);
			
			Если ЗавершенСОшибкой = Истина Тогда
				Тайминг = 7;
			КонецЕсли;	
					
			ПодключитьОбработчикОжидания("ПробитьЧекОбработчикТаймера", Тайминг, Истина);
			
		Иначе
			
			ЭтотОбъект.ВремяКонцаОбработкиОчереди = ТекущаяДата();
			ЗатраченоВремени                      = ЭтотОбъект.ВремяКонцаОбработкиОчереди - ЭтотОбъект.ВремяНачалаОбработкиОчереди;
			РасчетныйИнтервалЗадержки             = ЭтотОбъект.ИнтервалыОпросаОчереди - ЗатраченоВремени;
			РасчетныйИнтервалЗадержки             = ?(РасчетныйИнтервалЗадержки <= 0, 0.3, РасчетныйИнтервалЗадержки);
			
			УстановитьКартинкуСтатуса(0, Истина);

			ПодключитьОбработчикОжидания("ОбработчикТаймераПоступленияДокументовНаФискализацию", РасчетныйИнтервалЗадержки, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Удалить документ из очереди печати
//
// Параметры:
//  ДокументСсылка	 - 	 - 
//
&НаКлиенте
Процедура УдалитьДокументИзОчередиПечати(ДокументОплаты)
	
	ЭлементСписка = ОчередьФискализации.НайтиПоЗначению(ДокументОплаты);
	Если ЭлементСписка<> Неопределено Тогда
		ОчередьФискализации.Удалить(ЭлементСписка);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Записать результат пробития чека
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//  НомерЧекаККМ	 - 	 - 
//
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатПробитияЧека(ДокументОплаты, НомерЧекаККМ, ТекущаяКассоваяСмена, ИдентификаторФискальнойЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СчетчикПопыток = 0;
	
	Пока СчетчикПопыток < 5 Цикл
		
		НачатьТранзакцию();
		
		Попытка 
						
			ДокументОбъект              = ДокументОплаты.ПолучитьОбъект();
			ДокументОбъект.НомерЧекаККМ = НомерЧекаККМ;
			
			//На случай если док. был создан в прошлой кассовой смене и она уже закрылась
			//подменяем его на ту смену в которой он был пробит
			Если ДокументОбъект.КассоваяСмена <> ТекущаяКассоваяСмена Тогда
				ДокументОбъект.КассоваяСмена = ТекущаяКассоваяСмена;
			КонецЕсли;
			
			Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация") Тогда      				
				МассивНеоплаченныхСтрок = ДокументОбъект.УчтенныеАвансы.НайтиСтроки(Новый Структура("НомерЧекаККМ, ТипАвансовыхСредств", 0, Перечисления.ТипыДенежныхСредств.ЛицевойСчет));
				Для Каждого ЭлементМ Из МассивНеоплаченныхСтрок Цикл
					ЭлементМ.ИдентификаторФискальнойЗаписи	= ИдентификаторФискальнойЗаписи; 
					ЭлементМ.НомерЧекаККМ					= НомерЧекаККМ;  				 
				КонецЦикла;				
			КонецЕсли;
						
			ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);			
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
			
		Исключение	
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
			Если СчетчикПопыток = 5 Тогда
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;

	РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьПризнакУспешногоПробитияЧека(ДокументОплаты, НомерЧекаККМ);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Процедура, записывает бесплатную реализацию как "Пробито" в регистр сведений "ОчередьКассовогоСервера" 
// 
&НаСервереБезКонтекста
Процедура ЗаписатьПризнакПробитияЧекаРеализацияБесплатно(ДокументОплаты)
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьПризнакУспешногоПробитияЧека(ДокументОплаты, 1);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция - Фискализация документа разрешена
//
// Параметры:
//  Документ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция ФискализацияДокументаРазрешена(Документ, ОписаниеЗапрета = Неопределено)
	
	Если Документ.Проведен = Ложь ИЛИ Документ.ПометкаУдаления Тогда  		
		ОписаниеЗапрета = "Документ не проведен";
		Возврат Ложь; 		
	КонецЕсли;
	
	Если (ТипЗнч(Документ) <> Тип("ДокументСсылка.Реализация")
		И ЗначениеЗаполнено(Документ.НомерЧекаККМ))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.Реализация")
		И Документ.УчтенныеАвансы.НайтиСтроки(Новый Структура("НомерЧекаККМ, ТипАвансовыхСредств", 0, Перечисления.ТипыДенежныхСредств.ЛицевойСчет)).Количество() = 0) Тогда  
		
		ОписаниеЗапрета = "Документ уже пробит на ФР.";
		Возврат Ложь; 
	КонецЕсли; 
		
	Возврат Истина;
	
КонецФункции

// Функция, возвращает признак того, что вся реализация
// сделана как "Бесплатно"
//
&НаСервереБезКонтекста
Функция ДокументРеализацияБесплатно(Документ)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Реализация") 
		и Документ.Запасы.Итог("Сумма") = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

// Процедура - Записать ошибку печати чека
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
//
&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуПечатиЧека(ДокументОплаты, ОписаниеОшибки)
	
	РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьОшибкуПробитияЧека(ДокументОплаты, ОписаниеОшибки);
		
КонецПроцедуры

// Процедура - Записать в журнал регистрации ошибку
//
// Параметры:
//  ОписаниеОшибки	 - 	 - 
//
&НаСервереБезКонтекста
Процедура ЗаписатьВЖурналРегистрацииОшибку(ОписаниеОшибки)
	
	ЗаписьЖурналаРегистрации("Кассовый сервер",
	УровеньЖурналаРегистрации.Ошибка,,, 
	ОписаниеОшибки);	
	
КонецПроцедуры

// Процедура - Записать в журнал регистрации сообщение
//
// Параметры:
//  ТекстСообщения	 - 	 - 
//
&НаСервереБезКонтекста
Процедура ЗаписатьВЖурналРегистрацииСообщение(ТекстСообщения)
	
	ЗаписьЖурналаРегистрации("Кассовый сервер",
	УровеньЖурналаРегистрации.Информация,,, 
	ТекстСообщения);	
	
КонецПроцедуры

// Процедура - Установить картинку статуса
//
// Параметры:
//  Состояние	 - 	 - 
//  Видимость	 - 	 - 
//
&НаКлиенте
Процедура УстановитьКартинкуСтатуса(Состояние, Видимость)
	
	Элементы.СтатусОперации.Видимость = Видимость;
	
	Если Состояние = 0 Тогда
		Элементы.СтатусОперации.Картинка = БиблиотекаКартинок.Ожидание32;
	ИначеЕсли Состояние = 1 Тогда
		Элементы.СтатусОперации.Картинка = БиблиотекаКартинок.ВнешнееОборудованиеККТ32;
	ИначеЕсли Состояние = 2 Тогда
		Элементы.СтатусОперации.Картинка = БиблиотекаКартинок.Предупреждение32;
	ИначеЕсли Состояние = 3 Тогда
		Элементы.СтатусОперации.Картинка = БиблиотекаКартинок.ОткрытьКассовуюСмену32;
	ИначеЕсли Состояние = 4 Тогда
		Элементы.СтатусОперации.Картинка = БиблиотекаКартинок.ZОтчет32;
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Отобразить состояние кассовой смены
//
// Параметры:
//  СостояниеКассовойСмены	 - 	 - 
//
&НаКлиенте
Процедура ОтобразитьСостояниеКассовойСмены(СостояниеКассовойСмены)
	
	Если СостояниеКассовойСмены <> Неопределено Тогда
		
		Если НЕ СостояниеКассовойСмены.СтатусыКассовойСмены = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта") Тогда
			
			Элементы.ДекорацияОжиданиеОткрытияКассовойСмены.Видимость = Истина;
			ЭтотОбъект.ДатаКассовйСмены                               = СостояниеКассовойСмены.ОкончаниеКассовойСмены;
			Элементы.ДатаКассовойСмены.ЦветТекста                     = WebЦвета.Красный;
			Элементы.ДатаКассовойСмены.Заголовок                      = НСтр("ru = 'Смена закрыта'; en = 'Shift is closed'");
			
		Иначе
			
			Элементы.ДекорацияОжиданиеОткрытияКассовойСмены.Видимость = Ложь;
			ЭтотОбъект.ДатаКассовйСмены                               = СостояниеКассовойСмены.НачалоКассовойСмены;
			Элементы.ДатаКассовойСмены.ЦветТекста                     = WebЦвета.Черный;
			Элементы.ДатаКассовойСмены.Заголовок                      = НСтр("ru = 'Смена открыта'; en = 'Shift is open'");
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ДекорацияОжиданиеОткрытияКассовойСмены.Видимость = Истина;
		ЭтотОбъект.ДатаКассовйСмены                               = Неопределено;
		Элементы.ДатаКассовойСмены.ЦветТекста                     = WebЦвета.Красный;
		Элементы.ДатаКассовойСмены.Заголовок                      = НСтр("ru = 'Смена закрыта'; en = 'Shift is closed'");
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Отобразить состояние кассовой смены сервер
//
// Параметры:
//  СостояниеКассовойСмены	 - 	 - 
//
&НаСервере
Процедура ОтобразитьСостояниеКассовойСменыСервер(СостояниеКассовойСмены)
	
	Если СостояниеКассовойСмены <> Неопределено Тогда
		
		Если НЕ СостояниеКассовойСмены.СтатусыКассовойСмены = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта") Тогда
			
			Элементы.ДекорацияОжиданиеОткрытияКассовойСмены.Видимость = Истина;
			ЭтотОбъект.ДатаКассовйСмены                               = СостояниеКассовойСмены.ОкончаниеКассовойСмены;
			Элементы.ДатаКассовойСмены.ЦветТекста                     = WebЦвета.Красный;
			Элементы.ДатаКассовойСмены.Заголовок                      = НСтр("ru = 'Смена закрыта'; en = 'Shift is closed'");
			
		Иначе
			
			Элементы.ДекорацияОжиданиеОткрытияКассовойСмены.Видимость = Ложь;
			ЭтотОбъект.ДатаКассовйСмены                               = СостояниеКассовойСмены.НачалоКассовойСмены;
			Элементы.ДатаКассовойСмены.ЦветТекста                     = WebЦвета.Черный;
			Элементы.ДатаКассовойСмены.Заголовок                      = НСтр("ru = 'Смена открыта'; en = 'Shift is open'");
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ДекорацияОжиданиеОткрытияКассовойСмены.Видимость = Истина;
		ЭтотОбъект.ДатаКассовйСмены                               = Неопределено;
		Элементы.ДатаКассовойСмены.ЦветТекста                     = WebЦвета.Красный;
		Элементы.ДатаКассовойСмены.Заголовок                      = НСтр("ru = 'Смена закрыта'; en = 'Shift is closed'");
		
	КонецЕсли;
		
КонецПроцедуры

#Область ПодготовкаДанныхЧекаОплатыПродажи

// Функция - Подготовить параметры чека на печать
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляККТ(ДокументОплаты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВидНалога      = Неопределено;
	Касса          = Неопределено;
	СуммаДокумента = 0;
	ВидОперации    = Перечисления.ВидыОпераций.Продажа;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
		
		ВидОперации = ДокументОплаты.ВидОперации;		
		
		Если ДокументОплаты.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
			ВидНалога = ?(ЗначениеЗаполнено(ДокументОплаты.Организация.СистемаНалогообложенияДляАвансов), 
				ДокументОплаты.Организация.СистемаНалогообложенияДляАвансов, ВидНалога);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования) 
			И (ТипЗнч(ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования) = Тип("ДокументСсылка.Реализация")
			ИЛИ ТипЗнч(ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования) = Тип("ДокументСсылка.Прием")) Тогда
			
			ВидНалога   = ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования.ВидНалога;			
			ВидОперации = Перечисления.ВидыОпераций.Продажа;
			
		ИначеЕсли ЗначениеЗаполнено(ДокументОплаты.РасшифровкаПлатежа[0].ДокументАванса) 
			И (ТипЗнч(ДокументОплаты.РасшифровкаПлатежа[0].ДокументАванса) = Тип("ДокументСсылка.ПланЛечения")
			ИЛИ ТипЗнч(ДокументОплаты.РасшифровкаПлатежа[0].ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ")) Тогда
			
			ВидНалога   = ДокументОплаты.РасшифровкаПлатежа[0].ДокументАванса.ВидНалога;			
			ВидОперации = Перечисления.ВидыОпераций.Продажа;
			
		КонецЕсли;
		
		Касса          = ДокументОплаты.Касса;
		СуммаДокумента = ДокументОплаты.СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда	
		
		ВидОперации	   = Перечисления.ВидыОпераций.Возврат;
		Касса          = ДокументОплаты.Касса;
		СуммаДокумента = ДокументОплаты.СуммаДокумента;
		Если ЗначениеЗаполнено(ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования)
			И ТипЗнч(ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			ВидНалога = ДокументОплаты.РасшифровкаПлатежа[0].ДокументОснования.ВидНалога;
		КонецЕсли;
		
	КонецЕсли;     	
	
	Организация    = ДокументОплаты.Организация;
    ПочтаКлиента   = Неопределено;
	ТелефонКлиента = Неопределено;    	
	
	ЗаполнитьКонтактнуюИнформацию(ДокументОплаты, ПочтаКлиента, ТелефонКлиента, Касса);  	

	Если (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОплаты, "ВнешняяСистема") И Не ЗначениеЗаполнено(ДокументОплаты.ВнешняяСистема) 
		И ЗначениеЗаполнено(ДокументОплаты.АвторДокумента)
		И (ДокументОплаты.АвторДокумента.Наименование <> "<Не указан>" 
		И ДокументОплаты.АвторДокумента.Наименование <> "Служебный пользователь API (не удалять!)")) Тогда
		
		СотрудникДляЧека = ДокументОплаты.АвторДокумента;
	Иначе
		СотрудникДляЧека = ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь");
	КонецЕсли;
			
	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ПараметрыЧека.ВидОперации             = ВидОперации;
	ПараметрыЧека.СтруктурнаяЕдиница      = ДокументОплаты.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ДокументОплаты.Организация;
	ПараметрыЧека.Сотрудник               = СотрудникДляЧека;
	ПараметрыЧека.Клиент                  = ДокументОплаты.Контрагент;
	ПараметрыЧека.Дата                    = ТекущаяДата();
	ПараметрыЧека.Касса                   = Касса;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = СуммаДокумента;
	ПараметрыЧека.ВидНалога               = ВидНалога; 
	ПараметрыЧека.ТипЧека                 = ?(ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.СписаниеДенежныхСредств"), 1, 0);
    ПараметрыЧека.ВыводитьЧекНаБумагу     = ЭтотОбъект.ПечатьНаБумаге;
	
	Если НЕ ЗначениеЗаполнено(ПочтаКлиента) И НЕ ЗначениеЗаполнено(ТелефонКлиента) Тогда
		ПараметрыЧека.НомерТелефонаКлиента    = Неопределено;
		ПараметрыЧека.ЭлектроннаяПочтаКлиента = Неопределено;                           
	ИначеЕсли ЗначениеЗаполнено(ПочтаКлиента) Тогда		
		ПараметрыЧека.ЭлектроннаяПочтаКлиента = ПочтаКлиента;  
		ПараметрыЧека.НомерТелефонаКлиента    = Неопределено;
	Иначе		
		ПараметрыЧека.НомерТелефонаКлиента    = ТелефонКлиента;
		ПараметрыЧека.ЭлектроннаяПочтаКлиента = Неопределено;
	КонецЕсли;

	ПараметрыЧека.МассивПараметровТовары = Обработки.КассовыйСервер.ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ(ДокументОплаты, Касса); 		
	ПараметрыЧека.МассивПараметровОплаты = ПолучитьМассивОплатФискальногоЧекаОплатыПродажи(ДокументОплаты);	
	
	ПараметрыЧека.СуммаКОплате = ПолучитьСуммуКОплатеПоТабТоваров(ПараметрыЧека.МассивПараметровТовары);

	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(ДокументОплаты);
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	

	Возврат ФормированиеЧека;
	
КонецФункции

// Функция - Получить сумму оплаты по документу задолженности
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПолучитьСуммуКОплатеПоТабТоваров(МассивПараметровТовары)
	
	СуммаКОплате = 0;
	Для Каждого СтрокаТ ИЗ МассивПараметровТовары Цикл		
		СуммаКОплате = СуммаКОплате + СтрокаТ.СтоимостьСоСкидкой;		
	КонецЦикла;

	Возврат СуммаКОплате;
КонецФункции

// Функция - Получить массив оплат на печать
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПолучитьМассивОплатФискальногоЧекаОплатыПродажи(ДокументОплаты)
	
	МассивОплат = Новый Массив;		
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") ИЛИ ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		
		ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
		ПараметрыТипаОплаты.ТипОплаты = ДокументОплаты.ТипДенежныхСредств;
		ПараметрыТипаОплаты.Сумма     = ДокументОплаты.СуммаДокумента;
		
		МассивОплат.Добавить(ПараметрыТипаОплаты);	
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация") Тогда
		
		Для Каждого СтрокаТ ИЗ ДокументОплаты.УчтенныеАвансы Цикл
			
			Если СтрокаТ.НомерЧекаККМ <> 0 Или СтрокаТ.ТипАвансовыхСредств <> Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
				Продолжить;
			КонецЕсли;
						
			ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
			ПараметрыТипаОплаты.ТипОплаты = СтрокаТ.ТипАвансовыхСредств;
			ПараметрыТипаОплаты.Сумма     = СтрокаТ.СуммаАванса;
			
			МассивОплат.Добавить(ПараметрыТипаОплаты);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивОплат;	
	
КонецФункции

// Функция - Подготовить параметры чека на печать
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляФР(ДокументОплаты)
	
	ВидНалога      = Неопределено;
	Касса          = Неопределено;
	СуммаДокумента = 0;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
		
		Если ДокументОплаты.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
			ВидНалога = ?(ЗначениеЗаполнено(ДокументОплаты.Организация.СистемаНалогообложенияДляАвансов), ДокументОплаты.Организация.СистемаНалогообложенияДляАвансов, ВидНалога);			
		КонецЕсли;   
		
		Если ЗначениеЗаполнено(ДокументОплаты.РасшифровкаПлатежа[0].Основание)
			И ТипЗнч(ДокументОплаты.РасшифровкаПлатежа[0].Основание) = Тип("ДокументСсылка.Реализация") Тогда
			
			ВидНалога = ДокументОплаты.РасшифровкаПлатежа[0].Основание.ВидНалога;
			
		КонецЕсли;
		
		Касса          = ДокументОплаты.Касса;
		СуммаДокумента = ДокументОплаты.СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация") Тогда
		
		ВидНалога      = ДокументОплаты.ВидНалога;
		Касса          = ДокументОплаты.УчтенныеАвансы[0].КассаОплаты;
		СуммаДокумента = Документы.Реализация.ПолучитьСуммуНеФискализированныхУчтенныхАвансов(ДокументОплаты);//ДокументОплаты.УчтенныеАвансы.Итог("СуммаАванса");
		
	КонецЕсли;

	Организация		= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОплаты, "Организация");
	ПочтаКлиента   	= Неопределено;
	ТелефонКлиента 	= Неопределено;
	
	ЗаполнитьКонтактнуюИнформацию(ДокументОплаты, ПочтаКлиента, ТелефонКлиента, Касса);
	
	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ПараметрыЧека.ВидОперации            = Перечисления.ВидыОпераций.Продажа;
	ПараметрыЧека.СтруктурнаяЕдиница     = ДокументОплаты.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация            = ДокументОплаты.Организация;
	ПараметрыЧека.Сотрудник              = ?(ЗначениеЗаполнено(ДокументОплаты.АвторДокумента), 
												ДокументОплаты.АвторДокумента, 
												ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь"));
	ПараметрыЧека.Клиент                 = ДокументОплаты.Контрагент;
	ПараметрыЧека.Дата                   = ТекущаяДата();
	ПараметрыЧека.Касса                  = Касса;
	ПараметрыЧека.Количество             = 1;
	ПараметрыЧека.СуммаОплачено          = СуммаДокумента;
	ПараметрыЧека.СтоимостьБезСкидки     = СуммаДокумента;		
	ПараметрыЧека.Наименование           = НСтр("ru='Оплата от:';en='Payment from:'") + " " + ДокументОплаты.Контрагент;;
	ПараметрыЧека.ТипЧека                = 0;
	
	//ККТ-ые пар-ы
	ПараметрыЧека.ВидНалога               = ВидНалога; 	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = Ложь;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ТелефонКлиента;

	ПараметрыЧека.МассивПараметровТовары = ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляФР(ДокументОплаты);		
	ПараметрыЧека.МассивПараметровОплаты = ПолучитьМассивОплатФискальногоЧекаОплатыПродажи(ДокументОплаты);	
	
	ПараметрыЧека.СуммаКОплате           = ПолучитьСуммуКОплатеПоТабТоваров(ПараметрыЧека.МассивПараметровТовары);
	
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(ДокументОплаты);
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоИНеФискальногоЧекаФР(ПараметрыЧека);	

	Возврат ФормированиеЧека;
	
КонецФункции

&НаСервере
//Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляФР(ДокументОплаты)
	
	МассивДокументовРеализации = Новый Массив;
		
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДокументОплаты.РасшифровкаПлатежа Цикл
			МассивДокументовРеализации.Добавить(СтрокаТЧ.Основание);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация") Тогда
		
		МассивДокументовРеализации.Добавить(ДокументОплаты);
		
	КонецЕсли;

	МассивТоваров = Новый Массив;
    Для Каждого Основание ИЗ МассивДокументовРеализации Цикл
		
		Организация        = Основание.Организация;		
		ОплатаПоРеализации = 0;
		СуммаДокумента     = 0;
		
		ОплатаПоРеализации = СуммаОплатыРеализацииДоТекущегоДокумента(Основание, ДокументОплаты.Дата);	
		СуммаДокумента     = Основание.СуммаДокумента;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.Реализация") Тогда
			
			Если ОплатаПоРеализации = 0  Тогда
				
				Для Каждого СтрокаЗапаса ИЗ Основание.Запасы Цикл
					
					Если СтрокаЗапаса.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МодификаторЧленствПакетов 
						И СтрокаЗапаса.КоличествоУпаковок * СтрокаЗапаса.Цена = 0 Тогда				
						Продолжить;
					КонецЕсли;
					
					СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
					
					СтрокаТовара.Номенклатура           = СтрокаЗапаса.Номенклатура;
					СтрокаТовара.Наименование           = СтрокаЗапаса.Номенклатура.Наименование;
					СтрокаТовара.СтоимостьБезСкидки     = СтрокаЗапаса.КоличествоУпаковок * СтрокаЗапаса.Цена;
					СтрокаТовара.СуммаСкидки            = (СтрокаЗапаса.КоличествоУпаковок * СтрокаЗапаса.Цена) - СтрокаЗапаса.Всего;
					СтрокаТовара.СтоимостьСоСкидкой     = СтрокаТовара.СтоимостьБезСкидки - СтрокаТовара.СуммаСкидки;
					СтрокаТовара.Количество             = СтрокаЗапаса.КоличествоУпаковок;
					СтрокаТовара.СтавкаНДС              = СтрокаЗапаса.СтавкаНДС;
					СтрокаТовара.СуммаНДС               = СтрокаЗапаса.СуммаНДС;
					СтрокаТовара.НомерСекции            = Справочники.Кассы.ВернутьСекциюПоНоменклатуре(СтрокаЗапаса.Номенклатура, ЭтотОбъект.КассаФискализации);
					СтрокаТовара.Штрихкод               = РегистрыСведений.Штрихкоды.ПоулчитьШтрихкодПоОбъекту(СтрокаЗапаса.Номенклатура, СтрокаЗапаса.Партия);
					СтрокаТовара.ЭтоОплатаКредита       = Ложь;
					
					МассивТоваров.Добавить(СтрокаТовара);
					
				КонецЦикла; 
				
			Иначе
				
				СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
				
				СтрокаТовара.Номенклатура           = Справочники.Номенклатура.ПустаяСсылка();
				СтрокаТовара.Наименование           = "Продажа №" + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Основание.Номер, Организация.Префикс) + " - Частичная оплата";
				СтрокаТовара.СтоимостьБезСкидки     = СтрокаТЧ.Сумма;
				СтрокаТовара.СтоимостьСоСкидкой     = СтрокаТЧ.Сумма;
				СтрокаТовара.СуммаСкидки            = 0;
				СтрокаТовара.Количество             = 1;
				СтрокаТовара.ЭтоОплатаКредита       = ВыполняетсяПостоплатаРеализации(Основание, Истина);
				
				Если ЗначениеЗаполнено(Организация) Тогда
					
					СтрокаТовара.СтавкаНДС = Ценообразование.ПолучитьСтавкуНДСНоменклатуры(Новый Структура("Организация", Организация));
					СтрокаТовара.СуммаНДС  = Цел(Ценообразование.РассчитатьСуммуНДС(СтрокаТовара.СтоимостьБезСкидки , СтрокаТовара.СтавкаНДС, Основание.СуммаВключаетНДС));
					
				КонецЕсли;
				
				МассивТоваров.Добавить(СтрокаТовара);
				
				//МассивТоваров.Добавить(Новый Структура("Наименование, СтоимостьБезСкидки, Количество", 
				//"Продажа №" + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СтрокаТЧ.Основание.Номер, Объект.Организация.Префикс)+
				//" частичная оплата", СтрокаТЧ.Сумма , 1));			
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТоваров;
	
КонецФункции

// Функция - Сумма оплаты реализации
//
// Параметры:
//  Реализация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СуммаОплатыРеализацииДоТекущегоДокумента(Реализация, Дата)
	
	Возврат РегистрыНакопления.Оплаты.ПолучитьСуммуОплатыПоДокументу(Реализация, Дата - 10);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Реализация доплачивается
//
// Параметры:
//  Реализация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполняетсяПостоплатаРеализации(Реализация, ЭтоПерваяОплата)
	
	Возврат (ЭтоПерваяОплата = Ложь И РегистрыНакопления.РасчетыСПокупателями.ПолучитьДокументыОплатыПоДокументуРеализации(Реализация).Количество() > 1)
	ИЛИ ЗначениеЗаполнено(Реализация.НомерЧекаККМ);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ДополнительныеПроцедуры

&НаСервере
//Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(СуммаВзноса, Организация)
	
	МассивТоваров = Новый Массив;
	
	СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	СтрокаТовара.Наименование           = НСтр("ru='Взнос на лицевой счет';en='Contribution to personal account'");
	СтрокаТовара.СтоимостьБезСкидки     = СуммаВзноса;
	СтрокаТовара.СтавкаНДС              = МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(Организация);
	СтрокаТовара.СуммаНДС               = Ценообразование.РассчитатьСуммуНДС(СуммаВзноса, СтрокаТовара.СтавкаНДС, Справочники.ВидыЦен.Розничная.ЦенаВключаетНДС);
	СтрокаТовара.ЭтоОплатаКредита       = Ложь;
	СтрокаТовара.СуммаОплачено          = СуммаВзноса;
	
	МассивТоваров.Добавить(СтрокаТовара);
	
	Возврат МассивТоваров;
	
КонецФункции    

// Функция - Касса используется ККТ
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция КассаИспользуетсяККТ(Касса)
	Возврат Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;		
КонецФункции

// Функция - Использовать старую систему формирования для ф рдля ККТ
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса)	
	Возврат Справочники.Кассы.ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса);	
КонецФункции

// Функция - Получить текущую открытую кассовую смену
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция ПолучитьСостояниеКассовойСмены(Касса) Экспорт
	
    Возврат Документы.КассоваяСмена.ПолучитьСостояниеКассовойСмены(Касса);	
	
КонецФункции

&НаСервере
// Процедура заполняет контактную информацию.
//
Процедура ЗаполнитьКонтактнуюИнформацию(ДокументОплаты, ПочтаКлиента, ТелефонКлиента, Касса)
	
	Если Не ЗначениеЗаполнено(ДокументОплаты) Тогда
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект.ПередаватьСмсКлиента 
		ИЛИ ЭтотОбъект.ПередаватьПочтуКлиента Тогда

		КонтактнаяИнформацияПлательщика = Неопределено;
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("КонтрагентПлательщик", ДокументОплаты.Метаданные()) Тогда
			КонтрагентПлательщик = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОплаты, "КонтрагентПлательщик");
			КонтактнаяИнформацияПлательщика = МенеджерОборудованияВызовСервера.ПолучитьКонтактнуюИнформацию(КонтрагентПлательщик,, Касса);  //КассаФискализации 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактнаяИнформацияПлательщика) Тогда
			
			ПочтаКлиента   = ?(ЭтотОбъект.ПередаватьПочтуКлиента, КонтактнаяИнформацияПлательщика.Email, Неопределено);
			ТелефонКлиента = ?(ЭтотОбъект.ПередаватьСмсКлиента И ЗначениеЗаполнено(Касса), КонтактнаяИнформацияПлательщика.Телефон, Неопределено);
			
			Если (Не ЗначениеЗаполнено(ПочтаКлиента) И ЭтотОбъект.ПередаватьПочтуКлиента)
				Или (Не ЗначениеЗаполнено(ТелефонКлиента) И ЭтотОбъект.ПередаватьСмсКлиента) Тогда
				
				Контрагент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОплаты, "Контрагент");
				КонтактнаяИнформация = МенеджерОборудованияВызовСервера.ПолучитьКонтактнуюИнформацию(Контрагент,, Касса);  //КассаФискализации 
				   				
				Если НЕ ЗначениеЗаполнено(ПочтаКлиента)
					И ЭтотОбъект.ПередаватьПочтуКлиента Тогда
					
					ПочтаКлиента = КонтактнаяИнформация.Email;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ТелефонКлиента)
					И ЭтотОбъект.ПередаватьСмсКлиента
					И ЗначениеЗаполнено(Касса) Тогда
					
					ТелефонКлиента = КонтактнаяИнформация.Телефон;
				КонецЕсли;   				
			КонецЕсли;
			
		Иначе
			
			Контрагент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОплаты, "Контрагент");
			КонтактнаяИнформация = МенеджерОборудованияВызовСервера.ПолучитьКонтактнуюИнформацию(Контрагент,, Касса);  //КассаФискализации 
			
			ПочтаКлиента   = ?(ЭтотОбъект.ПередаватьПочтуКлиента, КонтактнаяИнформация.Email, Неопределено);
			ТелефонКлиента = ?(ЭтотОбъект.ПередаватьСмсКлиента И ЗначениеЗаполнено(Касса), КонтактнаяИнформация.Телефон, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
